// local-storage-api.js — для роботи з локальним сховищем (збереження та завантаження завдань).

// =================================================================================
// getThemeLS()
// ---------------------------------------------------------------------------------
// Отримує      - нічого
// Повертає     - символьне значення поточної теми (або дефолтне)
// ---------------------------------------------------------------------------------
// Визначення поточної кольорової теми з LocalStorage color = 'theme-dark' / 'theme-light'
// Якщо немає ключа theme, то задати дефолтне значення 'theme-dark'
// ---------------------------------------------------------------------------------
export function getThemeLS() {
  let curTheme = localStorage.getItem('color');
  // Якщо немає ключа theme, то задати значення 'dark' та записати в LocalStorage
  if (curTheme === null) {
    curTheme = 'theme-dark';
    setThemeLS(curTheme);
  }
  return curTheme;
}
// =================================================================================

// =================================================================================
// setThemeLS(curTheme)
// ---------------------------------------------------------------------------------
// Отримує      - символьне значення поточної теми
// Повертає     - нічого
// ---------------------------------------------------------------------------------
// Запис поточної кольорової теми в LocalStorage color = 'theme-dark' / 'theme-light'
// ---------------------------------------------------------------------------------
export function setThemeLS(curTheme) {
  try {
    localStorage.setItem('color', curTheme);
  } catch (error) {
    console.log(`Помилка запису поточної теми ${curTheme} в LocalStorage`);
  }
}
// =================================================================================

// =================================================================================
// getTasksLS()
// ---------------------------------------------------------------------------------
// Отримує      - нічого
// Повертає     - масив з об'єктами - Задачами
// ---------------------------------------------------------------------------------
// Витягування з LocalStorage масиву поточних задач (ключ - 'tasks')
// Якщо немає ключа tasks, то повертаємо пустий масив
// ---------------------------------------------------------------------------------
export function getTasksLS() {
  // Отримуємо масив задач з LocalStorage та парсимо JSON
  let tasksArray = JSON.parse(localStorage.getItem('tasks'));
  // Якщо немає ключа tasks, то повертаємо пустий масив
  if (!tasksArray) {
    tasksArray = [];
  }
  return tasksArray;
}
// =================================================================================

// =================================================================================
// setTasksLS(tasksArray)
// ---------------------------------------------------------------------------------
// Отримує      - tasksArray (масив з об'єктами - Задачами)
// Повертає     - нічого
// ---------------------------------------------------------------------------------
// Запис в LocalStorage масиву поточних задач (ключ - 'tasks')
// ---------------------------------------------------------------------------------
export function setTasksLS(tasksArray) {
  try {
    // Записуємо масив задач в LocalStorage
    localStorage.setItem('tasks', JSON.stringify(tasksArray));
  } catch (error) {
    console.log(`Помилка запису масиву задач 'tasks' в LocalStorage`);
  }
}
// =================================================================================

// =================================================================================
// getLastIdLS()
// ---------------------------------------------------------------------------------
// Отримує      - нічого
// Повертає     - lastId - число - номер останньої задачі
// ---------------------------------------------------------------------------------
// Отримання з LocalStorage номеру останньої задачі (ключ - 'lastId')
// Якщо немає ключа lastId, то повертає число 0
// ---------------------------------------------------------------------------------
export function getLastIdLS() {
  // Отримуємо число з LocalStorage
  let lastId = Number(localStorage.getItem('lastId'));
  // Якщо немає ключа lastId, то повертаємо число 0
  if (!lastId) {
    lastId = 0;
  }
  return lastId;
}
// =================================================================================

// =================================================================================
// setLastIdLS(lastId)
// ---------------------------------------------------------------------------------
// Отримує      - lastId - число - номер останньої задачі
// Повертає     - нічого
// ---------------------------------------------------------------------------------
// Запис в LocalStorage масиву поточних задач (ключ - 'tasks')
// ---------------------------------------------------------------------------------
export function setLastIdLS(lastId) {
  try {
    // Записуємо номер останньої задачі в LocalStorage
    localStorage.setItem('lastId', JSON.stringify(lastId));
  } catch (error) {
    console.log(
      `Помилка запису номер останньої задачі ${lastId} в LocalStorage`
    );
  }
}
// =================================================================================
