// markup-tasks.js - для створення розмітки.

// =================================================================================
// markupTaskList(tasksArray)
// ---------------------------------------------------------------------------------
// Отримує      - tasksArray (масив об'єктів)
// Повертає     - розмітку
// ---------------------------------------------------------------------------------
// Створюємо розмітку списку задач
// ---------------------------------------------------------------------------------
export function markupTaskList(tasksArray) {
  // Створюємо розмітку, перебираючи масив задач
  let markup = tasksArray
    .map(task => {
      return `
      <li class="task-list-item" data-task="${task.id}">
        <button class="task-list-item-btn">Delete</button>
        <h3>${task.name}</h3>
        <p>${task.description}</p>
      </li>`;
    })
    .join('');

  // Повертаємо розмітку для списку задач
  return markup;
}
// =================================================================================
