// render-tasks.js — для роботи з DOM (додавання, видалення елементів).

import refs from './refs';

// =================================================================================
// renderAllTaskList(markup)
// ---------------------------------------------------------------------------------
// Отримує      - markup (розмітку)
// Повертає     - нічого
// ---------------------------------------------------------------------------------
// Створюємо розмітку списку задач
// ---------------------------------------------------------------------------------
export function renderAllTaskList(markup) {
  // Очищуємо список задач
  refs.taskList.innerHTML = '';
  // Додаємо розмітку до списку задач
  refs.taskList.insertAdjacentHTML('beforeend', markup);
}
// =================================================================================
