// tasks.js — для управління завданнями (логіка створення, збереження та відображення).

// =================================================================================
// addTask(name, description, tasksArray)
// ---------------------------------------------------------------------------------
// Отримує      - name (name of task)
//              - description (description of task)
//              - tasksArray (масив об'єктів)
// Повертає     - tasksArray (масив об'єктів)
// ---------------------------------------------------------------------------------
// Додаємо задачу в список задач
// ---------------------------------------------------------------------------------
export function addTask(id, name, description, tasksArray) {
  // Об'єкт - нова задача
  const newTask = {
    id,
    name,
    description,
  };

  // Додаємо в масив нову задачу
  tasksArray.push(newTask);
  // Повертаємо масив з новою задачею
  return tasksArray;
}
// =================================================================================

// =================================================================================
// removeTask(name, description, tasksArray)
// ---------------------------------------------------------------------------------
// Отримує      - removeId ( число - id видаляємої задачі)
//              - tasksArray (масив об'єктів)
// Повертає     - newTasksArray (масив об'єктів)
// ---------------------------------------------------------------------------------
// Додаємо задачу в список задач
// ---------------------------------------------------------------------------------
export function removeTask(removeId, tasksArray) {
  // Видаляємо вибрану задачу зі списку задач
  let newTasksArray = tasksArray.filter(task => task.id !== removeId);

  // Повертаємо новий масив без видаленої задачі
  return newTasksArray;
}
// =================================================================================
